#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_key_pair.lamp-keypair: Reading...
data.aws_vpc.default: Reading...
data.aws_key_pair.lamp-keypair: Read complete after 0s [id=key-09aab4aade01af17a]
data.aws_vpc.default: Read complete after 1s [id=vpc-0bbbdc9ed9ce5dd5e]
data.aws_security_group.default: Reading...
data.aws_security_group.default: Read complete after 0s [id=sg-01755862ae2f8c750]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.lamp-ec2 will be created
  + resource "aws_instance" "lamp-ec2" {
      + ami                                  = "ami-05c13eab67c5d8861"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "berna-lamp"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "LAMP-EC2"
        }
      + tags_all                             = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "LAMP-EC2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "f7d1405954b975a5ef9fcfdafddf81eb3db985e8"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_vpc_security_group_ingress_rule.http will be created
  + resource "aws_vpc_security_group_ingress_rule" "http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow http connections"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-01755862ae2f8c750"
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "Example"
        }
      + to_port                = 80
    }

  # aws_vpc_security_group_ingress_rule.https will be created
  + resource "aws_vpc_security_group_ingress_rule" "https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow https connections"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-01755862ae2f8c750"
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "Example"
        }
      + to_port                = 443
    }

  # aws_vpc_security_group_ingress_rule.ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow ssh connections"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-01755862ae2f8c750"
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "Example"
        }
      + to_port                = 22
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @bertei, Action: `pull_request`*